# №1
# Создайте функцию которая которая берёт лист делит его пополам и обе стороны разворачивает в противоположную сторону. Пример:
# Оригинальный Лист:
# list_1 = ['name', 'age', '1', '19']
# Изменённый Лист:
# list_1 = ['age', 'name', '19', '1']



# def splitandreserved():

#     list1 = ['amerika', 'afrika', 'malasia', 'belgium']
#     a = list1[0: 2]
#     b = list1[2: 5]
#     c = a.reverse()
#     d = b.reverse()
#     print(a, b)
    
# splitandreserved()    
    

# №2. 
# Создайте функцию которая генерирует 10 чисел Фибоначчи: 
# 1,1,2,3,5,8,13,21,34,...




# №3. 
# Создайте функцию сложения, затем функцию вычитания двух чисел...
# Создайте 3-ю функцию которая вызывает первые 2 внутри себя.
# def plusfunc():
#     a = 1
#     b = 2
#     print(a+b)
# plusfunc()
# def minusfunc():
#     a = 3
#     b =1
#     print(a-b)
# minusfunc()   
# def plusminusfunc():
#     plusfunc
#     minusfunc
# plusminusfunc()
# №4
# Спросите у пользователя имя файла. Создайте функцию которая создаёт файл с именем которое передал пользователь. 
# Присвойте ИМЯ функции к переменной и вызывайте функцию через переменную.

# def file1(ff):
#     nam = open(f'{ff}.txt,' 'w')
#     name.close(

# x = input()
# y = file1(x)
    
    

# №5
# Представьте Вы работаете в Мобильной Компании и вас попросили создать генератор номеров. 
# Создайте функцию gen_number() которая генерирует телефонный номер с кодом 0444 _ _ _ _ _ _. 
# Номера которые вы можете генерировать могут содержать 